In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('ejemplo3.csv')
df

   ID Nombre  Edad     Color
0   1    Ana    25      Azul
1   2  Pablo    25     Verde
2   3  Cobra    28      Rojo
3   4  Sofia    32  Amarillo
4   5   Luis    30      Azul

In [8]:
df['LongitudNombre'] = df['Nombre'].apply(len)
df

   ID Nombre  Edad     Color  Len_Nombre CodigoColor  LongitudNombre
0   1    Ana    25      Azul           3     #0000FF               3
1   2  Pablo    25     Verde           5     #00FF00               5
2   3  Cobra    28      Rojo           5     #FF0000               5
3   4  Sofia    32  Amarillo           5     #FFFF00               5
4   5   Luis    30      Azul           4     #0000FF               4

In [7]:
color_map = {
    'Azul': '#0000FF',
    'Verde': '#00FF00',
    'Rojo': '#FF0000',
    'Amarillo': '#FFFF00'
    }

df["CodigoColor"] = df['Color'].map(color_map)
df

   ID Nombre  Edad     Color  Len_Nombre CodigoColor
0   1    Ana    25      Azul           3     #0000FF
1   2  Pablo    25     Verde           5     #00FF00
2   3  Cobra    28      Rojo           5     #FF0000
3   4  Sofia    32  Amarillo           5     #FFFF00
4   5   Luis    30      Azul           4     #0000FF

In [9]:
#filtrar las filas cuya edad sea igual a 25 0 35 utilizando hay dos formas la segunda es con isin

df[(df['Edad'] == 25) | (df['Edad'] == 35)]

   ID Nombre  Edad  Color  Len_Nombre CodigoColor  LongitudNombre
0   1    Ana    25   Azul           3     #0000FF               3
1   2  Pablo    25  Verde           5     #00FF00               5

In [10]:
#if edad in [25,35] -> python
df[df['Edad'].isin([25, 35])]

   ID Nombre  Edad  Color  Len_Nombre CodigoColor  LongitudNombre
0   1    Ana    25   Azul           3     #0000FF               3
1   2  Pablo    25  Verde           5     #00FF00               5

In [11]:
#filtrar las filas cuya edad este en un rango de 28 y 32, dos opciones
df[(df['Edad']>=28) & (df['Edad']<=32)]

   ID Nombre  Edad     Color  Len_Nombre CodigoColor  LongitudNombre
2   3  Cobra    28      Rojo           5     #FF0000               5
3   4  Sofia    32  Amarillo           5     #FFFF00               5
4   5   Luis    30      Azul           4     #0000FF               4

In [12]:
df[df['Edad'].between(28, 32)]

   ID Nombre  Edad     Color  Len_Nombre CodigoColor  LongitudNombre
2   3  Cobra    28      Rojo           5     #FF0000               5
3   4  Sofia    32  Amarillo           5     #FFFF00               5
4   5   Luis    30      Azul           4     #0000FF               4

In [13]:
#Filtrar las filas  cuyo nombre empieza con A
df[df['Nombre'].str.startswith('A')]

   ID Nombre  Edad Color  Len_Nombre CodigoColor  LongitudNombre
0   1    Ana    25  Azul           3     #0000FF               3

In [14]:
#Filtrar las filas donde el nombre tiene mas de 4 caracteres 
df[df['Nombre'].apply(len)>4]

   ID Nombre  Edad     Color  Len_Nombre CodigoColor  LongitudNombre
1   2  Pablo    25     Verde           5     #00FF00               5
2   3  Cobra    28      Rojo           5     #FF0000               5
3   4  Sofia    32  Amarillo           5     #FFFF00               5

# Valores faltantes
isna() se aplica a todo el df, isnull() se aplica a la columna

In [3]:
import pandas as pd
df_nulls = pd.read_csv('ejemplo4.csv')
df_nulls

   ID Nombre  Edad     Color
0   1    Ana  25.0      Azul
1   2  Pablo  25.0     Verde
2   3  Cobra  28.0       NaN
3   4  Sofia   NaN  Amarillo
4   5   Luis  30.0      Azul

In [5]:
nan_rows = df_nulls.isna().sum(axis=1)
nan_rows[nan_rows > 0] #esos id tiene NaN

2    1
3    1
dtype: int64

In [6]:
import numpy as np
arr = np.array([[True, True], [False, True]])
print(arr)

[[ True  True]
 [False  True]]

In [7]:
arr.sum() # 3 son True

3

# Datos duplicados

In [10]:
import pandas as pd

data = {
    'Nombre': ['Ana', 'Juan', 'Pedro', 'Ana', 'María'],
    'Edad': [25, 30, 35, 25, 28],
    'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Madrid',  'Barcelona']
}

df = pd.DataFrame(data)
print(df)

  Nombre  Edad     Ciudad
0    Ana    25     Madrid
1   Juan    30  Barcelona
2  Pedro    35   Valencia
3    Ana    25     Madrid
4  María    28  Barcelona

In [11]:
df.duplicated()

0    False
1    False
2    False
3     True
4    False
dtype: bool

In [12]:
df.drop_duplicates()
#df.drop_duplicates(keep='last')

  Nombre  Edad     Ciudad
0    Ana    25     Madrid
1   Juan    30  Barcelona
2  Pedro    35   Valencia
4  María    28  Barcelona

# Conteo de valores

In [13]:
df = pd.read_csv('ejemplo3.csv')
df

   ID Nombre  Edad     Color
0   1    Ana    25      Azul
1   2  Pablo    25     Verde
2   3  Cobra    28      Rojo
3   4  Sofia    32  Amarillo
4   5   Luis    30      Azul

In [14]:
df['Color'].value_counts()

Color
Azul        2
Verde       1
Rojo        1
Amarillo    1
Name: count, dtype: int64

# Consultas estilo SQL - SQL like queries

In [15]:
import pandas as pd
ciudades = pd.read_csv('ejemplo5.csv')
ciudades

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    27    Sevilla
3    Ana    28     Madrid
4    Ana    28   Valencia

In [17]:
ciudades.query('edad > 25')

  nombre  edad     ciudad
1  María    30  Barcelona
2  Pedro    27    Sevilla
3    Ana    28     Madrid
4    Ana    28   Valencia

In [19]:
ciudades.query('edad > 25 and ciudad == "Madrid"')

  nombre  edad  ciudad
3    Ana    28  Madrid

In [21]:
c = "Barcelona"
ciudades.query(f'edad > 25 and ciudad == "{c}"')

  nombre  edad     ciudad
1  María    30  Barcelona

In [22]:
ciudades.query(f'edad > 25 and ciudad == @c')

  nombre  edad     ciudad
1  María    30  Barcelona